trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоЗатратыПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УПДАктОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2373e4ed-7dfa-4702-afa9-7a49ffe93157">
    <name>ДатаАктаОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285fc519-6042-40bc-bfb2-341e823756eb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf93793d-bd1a-4abd-be34-2aa0c671ef23">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a0e2a0c-4f47-493e-8984-be9ff25bc79f">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8b83e65e-41fc-4f1f-8f2e-f33f07070d11">
    <name>ПрибытиеНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d00b8315-1114-493a-b5bd-6c10509dae59">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КомментарийРаспределения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14e1790-ac00-460e-9656-31b62e963ccb">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a74cd19-a14f-4c73-a83e-9cc5a3651298">
      <name>СкладОснованияЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="961aa91f-f258-47f3-b868-9673a4117b30">
      <name>Рейсы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3900451-0683-4a94-9b3a-a1e23ac7028e">
      <name>ЗаказНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3ff6a3eb-0fa6-496a-951a-ed075c58d8bd">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3ee02ad-1208-4c1c-8b3d-5545d6658f2e">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗатратыПоДоставкеОтПоставщика/ЗатратыПоДоставкеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545d17ac-0e90-48b1-8c2f-a39030521465">
  <name>ЗатратыПоДоставкеОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7d074a69-8ef7-4a52-bbb5-af786b566393">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="eb22b9d3-92f6-4d37-b2b8-2e4a69a3b5a2">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b6fcbf9-c3bb-48e7-b31f-58d73056c093">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="c99814ac-b0b7-4d4a-9b8e-a02cd01bcc21">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3b1a5703-8382-42a9-ada8-9489846e93c6">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	если РольДоступна("_ЗапретПроведенияПриобретениеУслугПрочихАктивов") тогда
		Отказ=истина;
		Сообщить("У вас нет прав на проведение документа!");
	конецесли;	
	
	Если ЭтоЗатратыПоДоставке Тогда
		Для Каждого Расход Из Расходы Цикл
			Если ТипЗнч(Расход.ОснованиеЗатрат) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				Движение = Движения.ЗатратыПоДоставкеОтПоставщика.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Перевозчик = Контрагент;
				Движение.Документ = Расход.ОснованиеЗатрат;
				Движение.Сумма = Расход.СуммаСНДС;
			КонецЕсли;
		КонецЦикла;
		Движения.ЗатратыПоДоставкеОтПоставщика.Записывать= Истина; 
	
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
		если РольДоступна("_ЗапретПроведенияПриобретениеУслугПрочихАктивов") тогда
		Отказ=истина;
		Сообщить("У вас нет прав на отмену проведение документа!");
	конецесли;	

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ из Расходы Цикл  
		
		Если НЕ СтрокаТЧ.ОбъектРасходов.Пустая() и СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Объект расходов"" заполнить, а ""Аналитика объекта"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.Расходы[" + ИндексМассива + "].АналитикаОбъекта");
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ОбъектРасходов.Пустая() и НЕ СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Аналитика объекта"" заполнить, а ""Объект расходов"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.Расходы[" + ИндексМассива + "].ОбъектРасходов");
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
	
&После("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И Не ОбменДанными.Загрузка И Не ЭтоНовый() Тогда 
		Если ПометкаУдаления Тогда
			Если Не Ссылка.ПометкаУдаления Тогда
				ДополнительныеСвойства.Вставить("ИзменениеПриходныхДокументовВЗакрытомПериоде_ПометкаУдаления", "Удален документ " + Ссылка);
			КонецЕсли;	
		Иначе
			РеквизитыДляПроверки = Новый Массив; 
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Номер", "Номер"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Дата", "Дата"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Партнер", "Поставщик"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Контрагент", "Контрагент"));
			
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Соглашение", "Соглашение"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Организация", "Организация"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Договор", "Договор"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "Комментарий", "Комментарий"));
			
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "НомерВходящегоДокумента", "Номер входящего документа"));
			РеквизитыДляПроверки.Добавить(Новый Структура("Реквизит, ИмяРеквизита", "ДатаВходящегоДокумента", "Дата входящего документа"));
			
			ТЧДляПроверки = Новый Массив;
			ТЧДляПроверки.Добавить(Новый Структура("ТЧ, ИмяТЧ", "Расходы", "Таблица 'Расходы'"));
			
			Документы.КорректировкаПриобретения.ОбъектМодифицирован(Ссылка, ЭтотОбъект, РеквизитыДляПроверки, ТЧДляПроверки, ДополнительныеСвойства);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если Не Отказ И ДополнительныеСвойства.Свойство("ИзменениеПриходныхДокументовВЗакрытомПериоде_ПометкаУдаления") Тогда
		Документы.КорректировкаПриобретения.ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде(
			Организация, 
			Дата, 
			ДополнительныеСвойства.ИзменениеПриходныхДокументовВЗакрытомПериоде_ПометкаУдаления);	
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
